# GetGroups Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroupManager..::..GetGroups Method
LightGroupManager Class See Also
---
Get the set of contained LightGroup objects The set of LightGroup objects
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<LightGroup> GetGroups()
```

Visual Basic
---
```text
Public Function GetGroups As IList(Of LightGroup)
```

Visual C++
---
```text
public:
IList<LightGroup^>^ GetGroups()
```

# See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace